fonecmid-diplom/src/Documents/ВМК_ВыплатаЗарплаты/ВМК_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВМК_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВМК_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Выплата</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВМК_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВМК_ВзаиморасчетыССотрудниками/ВМК_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВМК_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВМК_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВМК_ВыплатаЗарплаты/ObjectModule.bsl
Процедура ЗаполнитьАвтоматически() Экспорт

	Выплата.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВМК_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	СУММА(ВМК_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВМК_ВзаиморасчетыССотрудниками.Остатки(&Дата, ) КАК ВМК_ВзаиморасчетыССотрудникамиОстатки
	|ГДЕ
	|	ВМК_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВМК_ВзаиморасчетыССотрудникамиОстатки.Сотрудник";
	Запрос.УстановитьПараметр("Дата", Дата );
	
	Выборка = Запрос.Выполнить().Выбрать();

    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Выплата.Добавить();
        НоваяСтрока.Сотрудник = Выборка.Сотрудник;
        НоваяСтрока.Сумма = Выборка.СуммаОстаток;
    КонецЦикла;
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр ВМК_ВзаиморасчетыССотрудниками
	Движения.ВМК_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаВыплата из Выплата Цикл
		Движение = Движения.ВМК_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сотрудник = ТекСтрокаВыплата.Сотрудник;
		Движение.Сумма = ТекСтрокаВыплата.Сумма;
	КонецЦикла;
	Движения.ВМК_ВзаиморасчетыССотрудниками.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
